package startandroid.ru.pm_7;


import androidx.appcompat.app.AppCompatActivity;
import android.content.Intent;
import android.os.Bundle;
import android.widget.TextView;
import android.widget.Toast;
import java.util.ArrayList;

public class ViewActivity extends AppCompatActivity {

    TextView descript,posit,pow,row,volt,amper,loc,mark,type,mMethod,fBearing,sBearing;
    boolean ch;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_view);

        ArrayList<Electric_motor> drive = new ArrayList<>();

        drive.add(new Electric_motor("01m040","Гидроразбиватель №1, загрузка ролла", 350,988, 3300,77.8,"HV2-2","WEG","HGF355C/D/E","B3","6322-C3","6319-C3"));
        drive.add(new Electric_motor("01m041","Гидроразбиватель №2, загрузка ролла",710,740,3300,157,"HV2-8","PERSON PEEBLES","T5006J","B3","",""));
        drive.add(new Electric_motor("01m066","Насос, смазка, гидроразбиватель №1",1.5,1420, 400,3.2,"5A-6","WEG","90L-04","B35","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("01m517","Насос, смазка, гидроразбиватель №2",3,1415, 400,6,"10A-4","WEG","100L-04","B5","6206ZZ","6205ZZ"));
        drive.add(new Electric_motor("01m001","Насос откачки из гидроразбивателя №1",75,990, 400,141,"2A-5","WEG","280S/M-06","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("01m002","Насос откачки из гидроразбивателя №2",132,985, 440,211,"0B-2","BROOK CROMTON","7Y-HAD315L","B3","",""));
        drive.add(new Electric_motor("01m540","Насос смазка, гидроразбиватель №2",1.1,930, 400,3.13,"10B-5","WEG","90L-06","B5","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("01m554","Конвейер А1, линия1",3,1500, 400,21,"MCC-1","SEW EURODRIVE","SA82DT100L4","B5","",""));
        drive.add(new Electric_motor("01m546","Конвейер H",11,1500, 400,21,"MCC-1","BAUER","BF90X-04","B5","",""));
        drive.add(new Electric_motor("01m546A","Конвейер H",11,1500, 400,21,"MCC-1","BAUER","BF90X-04","B5","",""));
        drive.add(new Electric_motor("01m555","Конвейер B, линия 1",4,1500, 400,8.4,"MCC-1","SEW EURODRIVE","KA96DV112M4","B5","",""));
        drive.add(new Electric_motor("01m561","Конвейер C, линия 2",4,1500, 400,8.4,"MCC-1","SEW EURODRIVE","KA96DV112M4","B5","",""));
        drive.add(new Electric_motor("01m556","Конвейер D1, линия 1",1.5,1500, 400,3.4,"MCC-1","SEW EURODRIVE","SA72TDT90L4","B5","",""));
        drive.add(new Electric_motor("01m562","Конвейер D2, линия 2",1.5,1500, 400,3.4,"MCC-1","SEW EURODRIVE","SA72TDT90L4","B5","",""));
        drive.add(new Electric_motor("01m565","Нассос гидравлики, конвейер №2",4.8,1425, 400,9.1,"MCC-1","ABB","MBT 132-S4","B35","",""));
        drive.add(new Electric_motor("01m558","Нассос гидравлики, конвейер №1",5.5,1440, 400,10.8,"MCC-1","INDUCTION","132S-4","B35","",""));
        drive.add(new Electric_motor("01m563","Нассос гидравлики(контоваткли), конвейер №2",15,1470, 400,27,"MCC-1","BROOK CROMTON","D160L","B35","",""));
        drive.add(new Electric_motor("01m557","Нассос гидравлики(контоваткли), конвейер №1",15,1460, 400,27.7,"MCC-1","INDUCTION","D160L-4","B35","",""));
        drive.add(new Electric_motor("01m547","Конвейер G,каретка",0.75,1500, 400,1.9,"MCC-1", "SEW EURODRIVE","SA62DT80","B5","",""));
        drive.add(new Electric_motor("01m553","Конвейер K,линия 2",0.75,1425, 400,1.85,"MCC-1", "WEG","60L-4","B5","6204-ZZ","6203-ZZ"));
        drive.add(new Electric_motor("01m552","Конвейер L,линия 2",0.75,1400, 400,1.82,"MCC-1", "BROOK CROMTON","AD80BD","B5","",""));
        drive.add(new Electric_motor("01m551","Конвейер M,линия 2",7.5,970, 400,15.5,"MCC-1", "BROOK CROMTON","AD160MD","B5","",""));
        drive.add(new Electric_motor("01m550","Конвейер N,линия 2",7.5,970, 400,15.5,"MCC-1", "BROOK CROMTON","AD160MD","B5","",""));
        drive.add(new Electric_motor("01m559","Охлаждающий вентилятор гидравлического бака, линия 1", 0.55,2830, 400,1.33,"MCC-1", "VEM","KPER 7162","B5","",""));
        drive.add(new Electric_motor("01m566","Охлаждающий вентилятор гидравлического бака, линия 2", 0.55,2830, 400,1.33,"MCC-1", "VEM","KPER 7162","B5","",""));
        drive.add(new Electric_motor("01m582","Пресс для кип, насос", 0,0,0,0,"MCC-1", "","","B5","",""));

        drive.add(new Electric_motor("02m071","3-Й Рафинер лиственной целлюлозы", 750,1490, 3300,160,"HV2-3","WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("02m075","2-ОЙ Рафинер лиственной целлюлозы", 750,1490, 3300,160,"HV2-4","WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("02m082","Cвинг рафинер", 750,1480, 3300,163,"HV2-5","LAURENCE SCOTT","BS500","B3","6219-C3","N215ECP"));
        drive.add(new Electric_motor("02m088","2-Й Рафинер хвойной целлюлозы", 750,1490, 3300,160,"HV2-6","WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("02m511","1-Й Рафинер лиственной целлюлозы", 750,1490, 3300,160,"HV2-7","WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("02m034","Осветленная вода на спрыски высокого давления", 150, 2975, 3300,32,"HV3-2","LAURENCE SCOTT","SQ D315/710","B3","",""));
        drive.add(new Electric_motor("02m607","2-Й Рафинер лиственной целлюлозы", 750,1490, 3300,160,"HV3-3","WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("02m043","Башня хвойной целлюлозы-мешалка", 55,1480, 415,98, "1A-1","ABB","M3BP250SMA4","B5","6315-C3","6313-C3"));
        drive.add(new Electric_motor("02m007","Насос подачи воды для гидроразбивателей", 55,1480, 440,90, "1A-7","BROOK CROMTON","7Y-HAD250S","B3","NU217","6217"));
        drive.add(new Electric_motor("02m010","Насос массы на подслой", 11,1465, 415,21.5, "2A-2","ABB","M2AA160M4","B3","6309-ZZ/C3","6209-ZZ/C3"));
        drive.add(new Electric_motor("02m003","Насос бака лиственной целлюлозы", 75,1485, 400,127, "7A-2","WEG","280S/M-04","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("02m1001","Оборотная вода в бак производства целлюлозы", 110, 1490, 400,194, "7A-3","WEG","315S/M-04","B3","6319-C3","6316-C3"));
        drive.add(new Electric_motor("02m1004","Композиционный бассейн-мешалка", 55,1480, 415,96, "8A-5","ABB","M3BP255SMC4","B3","6313-C3","6312-C3"));
        drive.add(new Electric_motor("02m026","Двигатель дисковой массоловки", 1.5,940, 380,4, "9A-4","SEW EURODRIVE","K97DRE100L6BE5HF","B5","",""));
        drive.add(new Electric_motor("02m029","Насос воды на разбавление во время обрыва", 90,1485, 415,154, "9A-6","WEG","280S/M-04","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("02m001","Мешалка", 3,960, 415,7.34, "10A-3","WEG","132S-06","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("02m042","Башня лиственной целлюлозы-мешалка", 37,985, 415,65, "11A-7","WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m1020","Промежуток бак-мешалка", 37,985, 415,65, "11A-8","WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m006","Нассос машинного бассейна", 110,990, 415,194, "13A-6","WEG","315S/M6","B3","6319-C3","6316-C3"));
        drive.add(new Electric_motor("02m065","Барабанный сгуститель лиственной целлюлозы", 18.5,1460, 440,37.5, "15A-1","SIEMENS","","B3","",""));
        drive.add(new Electric_motor("02m033","Насос мутной воды", 30,1480, 400,55, "1B-1","WEG","200L-04","B3","6312-C3","6312-Z-C3"));
        drive.add(new Electric_motor("02m070","Насос осветительной воды на спрыски среднего давления", 110,1480, 415,187, "4B-1","BROOK HANSEN","W-DF280MIN","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("02m045","Машинный бассеин - мешалка", 45,985, 415,84, "4B-2","WEG","280S/M-06","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("02m035","Осветленная вода на спрыски низкого давления", 75,1480, 440,117, "6B-1","BROOK CROMTON","7Y-HAD250M","B3","NU217",""));
        drive.add(new Electric_motor("02m473","Повысительный насос свежей воды", 160,1490, 415,271, "6B-2","WEG","315S/M-04","B3","6319-C3","6316-C3"));
        drive.add(new Electric_motor("02m1002","Нассос композиционного бассейна", 45,985, 415,84, "9B-1","WEG","280S/M-06","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("02m036","Насос воды на шланги и промывки", 30,1469, 440,50, "10B-8","BROOK CROMTON","YHADF200L","B3","","6312-R-C3"));
        drive.add(new Electric_motor("02m1023","Насос промежуточного бака лисвенной целлюлозы", 37,1485, 400,68, "5B-6","WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m1022","Промежуточный бак-мешалка", 37,985, 415,65, "2С-7", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m025","Дисковый фильтр", 7.5,1500, 400,15, "6C-1","ELDIN", "","B3","",""));
        drive.add(new Electric_motor("02m608","Двигатель присадки 2 рафинер лиственной целлюлозы", 1.1,2750, 440,2.77, "7C-2","WEG","90L-8/2","B5","6305-ZZ","6204-ZZ"));
        drive.add(new Electric_motor("02m1024","Насос откачки хвойной целлюлозы", 55,2960, 415,92.5, "1B-5","WEG","250S/M-02","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m524","Насос лиственной целлюлозы после сгустителя", 55,1475, 440,90, "8C-1","WEG","250S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("02m1021","Насос промежуточного бака хвойной целлюлозы", 18.5, 1470, 415,35, "8C-2","WEG","180M-04","B3","6311-C3","6311-C3"));
        drive.add(new Electric_motor("02m525","Двигатель присадки,1 рафинера", 1.3,2880, 440,3.3, "9C-1","SEW EURODRIVE","KF67R37DRS90M8/2","B5","",""));
        drive.add(new Electric_motor("02m089","Двигатель присадки,3 рафинера хвойной целлюлозы", 1.1,2750, 440,2.77, "9C-4","WEG","90L-8/2","B5","6305-ZZ","6204-ZZ"));
        drive.add(new Electric_motor("02m072","Двигатель присадки,3 рафинера лиственной целлюлозы", 1.1,2750, 440,2.77, "11C-1","WEG","90L-8/2","B5","6305-ZZ","6204-ZZ"));
        drive.add(new Electric_motor("02m076","Двигатель присадки,2 рафинера хвойной целлюлозы", 1.1,2750, 440,2.77, "11C-2","WEG","90L-8/2","B5","6305-ZZ","6204-ZZ"));
        drive.add(new Electric_motor("02m083","Двигатель присадки,1 рафинера хвойной целлюлозы", 1.1,2750, 440,2.77, "11C-3","WEG","90L-8/2","B5","6305-ZZ","6204-ZZ"));
        drive.add(new Electric_motor("02m004","Насос бака хвойной целлюлозы", 90,1480,440,144,"13C-4","BROOK CROMTON","7Z-HAD280S","B3","NU318","6314"));
        drive.add(new Electric_motor("02m656","Насос воды на регуляцию концетрации", 37,1480, 415, 68, "3J-1","ABB","M3AA225SMA4","B3","","6212"));

        drive.add(new Electric_motor("03m012","Смесительный насос №1", 630,993,6000,73.5, "HV5-25", "ABB","HGF450","B3","6328-C3","6322-C3"));
        drive.add(new Electric_motor("03m1028","Система нагрева напорного ящика №1", 0.75,3000,400, 1.9, "E-2.7.3", "GRUNDFOS","MG80A2-19FT100-H3","V1","6204","6201"));
        drive.add(new Electric_motor("03m1030","Система нагрева напорного ящика №2", 0.75,3000,400, 1.9, "E-2.7.4", "GRUNDFOS","MG80A2-19FT100-H3","V1","6204","6201"));
        drive.add(new Electric_motor("03m601","Мини-сортировка", 22,1450,415,41, "2A-3", "WEG","D180L","B3","6-311C3","6-211ZC3"));
        drive.add(new Electric_motor("03m038","Насос воды на уплотнение-резервный",11,2950,415,20, "6A-2", "WEG","160M-02","B3","6309-C3","6309-Z-C3"));
        drive.add(new Electric_motor("03m602","Насос питающий мини сортировку",15,1450,440,25, "8A-1", "BROOK HANSEN","HADF160L","B3","",""));
        drive.add(new Electric_motor("03m037","Насос воды на уплотнение",11,2955,415,20, "5B-3", "WEG","160M-02","B3","6309-C3","6309-Z-C3"));
        drive.add(new Electric_motor("03m1027","Насос подачи воды на декулятор системы разбавления",45,1480,415,79, "5B-6", "WEG","225S/M-04","B3","6314-C3","6314-Z-C3"));
        drive.add(new Electric_motor("03m098","Деклятор 2-ой ступени вакуум-насос",45,1483,415,81, "9B-2", "ABB","M3BP225SMB4","B3","NU313ECP","6212/C3"));
        drive.add(new Electric_motor("03m069","1-ая вторичная сортировка",22,1465,400,41, "9B-3", "SIEMENS","1LG-186-4MA60 180L","B3","6311-C3","6211-C3"));
        drive.add(new Electric_motor("03m031","Насос избытка оборотной воды",75,1480,440,117, "9B-4", "BROOK CROMTON","7Y-HAD250M","B3","NU217",""));
        drive.add(new Electric_motor("03m096","Деклятор 1-ой ступени вакуум-насос",200,1480,400,349, "14B-2", "ABB","M3BP315MLA4","B3","NU319ECP/C3","6316/C3"));
        drive.add(new Electric_motor("03m015","Насос на 4-Ю ступень очистки",15,1470,415,25, "6С-2", "WEG","160L-04","B3","6409-C3","6309-Z-C3"));
        drive.add(new Electric_motor("03m013","Насос на 2-Ю ступень очистки",132,990,400,231, "6С-4", "WEG","315/M-04","B3","6319-C3","6316-C3"));
        drive.add(new Electric_motor("03m111","Насос свежей воды на спрыски",90,2975,415,151, "7С-3", "WEG","280/M-02","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("03m068","2-ая сортировка",110,738,400,205, "8С-3", "SIEMENS","1LG4317-8AB60-Z315L","B3","NU319EP","6319C3"));
        drive.add(new Electric_motor("03m017","Очищающий насос 5-ой ступени",11,2955,415,20, "9С-5", "WEG","160M-02","B3","6309-C3","6309-Z-C3"));
        drive.add(new Electric_motor("03m067","2-я сортировка",110,738,400,205, "10С-1", "SIEMENS","1LG4317-8AB60-Z 315L","B3","NU319EP","6319C3"));
        drive.add(new Electric_motor("03m016","Насос отбросов из первой степени сортировки",75,1480,440,117, "10С-2", "BROOK CROMTON","7Y-HAD250M","B3","NU217",""));
        drive.add(new Electric_motor("03m009","Насос избытка оборотной воды",75,1485,415,127, "10С-3", "WEG","280S/M-04","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("03m1029","Насос на разбавление в напорном ящике",15,1475,440,28, "5С-7", "SIEMENS","1LE10011DB43AB43AB4Z160L","B3","6309-ZZ-C3","6309-ZZ-C3"));
        drive.add(new Electric_motor("03m109","Насос на спрыски низкого давления",37,1485,400,68, "11С-4", "WEG","225S/M-04","B3","6314","6314"));
        drive.add(new Electric_motor("03m014","Насос на 3-Ю ступень очистки",45,1475,415,79, "11С-5", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("03m613","Насос бака уплотнительной воды вакуум ящиков дуоформера",75,985,415,132, "12С-7", "BROOK CROMTON","WDF280M","B3","6318",""));
        drive.add(new Electric_motor("03m107","Насос мокрой обрезки кромки",1.5,2860,400,3.5, "10B-4", "ABB","M2AA90L-4","B5","6205-2Z/C3","6204-2Z/C3"));
        drive.add(new Electric_motor("03m108","Насос мокрой обрезки кромки(резервный)",1.5,2860,400,3.5, "10B-4", "ABB","M2AA90L-4","B5","6205-2Z/C3","6204-2Z/C3"));

        drive.add(new Electric_motor("04m585","Сортировка первичного брака",160,986,3300,38, "HV3-6", "LAURENCE SCOTT","SQ D315/710","B3","",""));
        drive.add(new Electric_motor("04m659","Дефлейкер №1",200,1481,3300,44, "HV3-7", "WEG","HGF315B","B3","NU320-MC3","6316-C3"));
        drive.add(new Electric_motor("04m1025","Насос бассейна мелованного брака",55,1480,440,90, "1A-2", "BROOK CROMTON","7Y-HAD250S","B3","",""));
        drive.add(new Electric_motor("04m1017","Мешалка мелванного брака",18.5,975,415,35, "2A-1", "WEG","200L-06","B3","6312-C3","6312-Z-C3"));
        drive.add(new Electric_motor("04m003","Циркуляционный насос сгущеного брака",90,1480,440,143, "6A-6", "BROOK CROMTON","7Z-HAD280S","B3","NU318","6314"));
        drive.add(new Electric_motor("04m1014","Мешалка бассейна сухого брака",45,985,415,84, "7A-1", "WEG","280S/M-06","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("04m005","Насос бассейна брака",55,1475,440,90, "8A-4", "BROOK CROMTON","7Z-HAD250S","B3","NU217","6217"));
        drive.add(new Electric_motor("04m063","Барабанный сгуститель №1",11,1460,420,23, "15A-2", "LENZE","MDERA XX160-22","V1","","6309-2RS"));
        drive.add(new Electric_motor("04m064","Барабанный сгуститель №2",11,1460,420,23, "15A-3", "LENZE","MDERA XX160-22","V1","","6309-2RS"));
        drive.add(new Electric_motor("04m586","Брак вторичной сортировки",37,1470,440,60, "16A-1", "BROOK HANSEN","W-DF225SN","B3","N313-C3","6313-C3"));
        drive.add(new Electric_motor("04m588","Насос бака чистого брака",18.5,1465,440,32, "16A-2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("04m587","Мешалка бака отбросов брака",11,970,440,22.5, "16A-4", "WEG","160M/06","B3","6309-ZZ","6309-ZZ"));
        drive.add(new Electric_motor("04m074","Насос сгущеного брака",55,1480,440,90, "11B-4","BROOK CROMTON","7Y-HAD250S","B3","",""));
        drive.add(new Electric_motor("04m044","Мешалка башни брака",37,985,400,65, "12B-9", "WEG","250SM6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("04m657","Насос бассейна сухого брака",45,1475,415,80, "1С-9", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("04m1016","Мешалка ,бассейна сухого брака",45,985,400,84, "2С-8", "WEG","280S/M-06","B3","6316-C3","6316-C3"));

        drive.add(new Electric_motor("05m606","2-я Мешалка гидроразбивателя под клильным прессом",350,1485,3300,74.5, "HV3-4", "WEG","HGF355C/D/E","B3","6322-C3","6319-C3"));
        drive.add(new Electric_motor("05m605","1-я Мешалка гидроразбивателя под клильным прессом",350,1480,3300,77, "HV3-5", "LORENCE SCOTT","SQ D355/800","B3","",""));
        drive.add(new Electric_motor("05m054","3-я Мешалка середины гауч-мешалки",45,985,440,76, "4B-3", "BROOK CROMTON","","B3","NU217","6217"));
        drive.add(new Electric_motor("05m055","1-я Мешалка гидроразбивателя под накатом",315,1488,6000,37.5, "HV5-28", "WEG","HGF355C/D/E","B3","NU-322-C3","6320-C3"));
        drive.add(new Electric_motor("05m056","2-я Мешалка гидроразбивателя под накатом",315,1488,6000,37.5, "HV5-2", "WEG","HGF355C/D/E","B3","NU-322-C3","6320-C3"));
        drive.add(new Electric_motor("05m024","Насос гидроразбивателя под накатом №2",90,1480,415,151, "E-6.1", "BROOK CROMTON","7Z-HAD280S","B3","",""));
        drive.add(new Electric_motor("05m023","Насос гидроразбивателя под накатом №1",90,1480,415,151, "E-10.1", "BROOK CROMTON","7Z-HAD280S","B3","",""));
        drive.add(new Electric_motor("05m604","Насос гидроразбивателя под клеильным прессом",75,980,440,130, "E-8.2", "WEG","280S/M-04","B3","6316-C3","6316-C3"));
        drive.add(new Electric_motor("05m049","Мешалка гауч-мешалки 1",30,1475,400,55, "1B-3", "ABB","M3BP200MLB4","B5","6312-C3","6310-C3"));
        drive.add(new Electric_motor("05m021","Насос гауч-мешалки №1",45,1470,440,73, "1B-4", "BROOK CROMTON","7Z-HAD225M","B3","",""));
        drive.add(new Electric_motor("05m022","Насос гидроразбивателя прессовой части",160,1490,415,271, "2B-1", "WEG","315S/M-04","B3","6319-C3","6316-C3"));
        drive.add(new Electric_motor("05m052","1-я мешалка задней стороны гауч-мешалки",45,985,440,76, "2B-2", "BROOK CROMTON","","B3","NU217","6217"));
        drive.add(new Electric_motor("05m050","Мешалка гауч-мешалки 2",30,1475,400,55, "3B-5", "ABB","M3BP200MLB4","B5","6312-C3","6310-C3"));
        drive.add(new Electric_motor("05m053","2-я Мешалка передней стороны гауч-мешалки ",55,985,440,98, "3B-6", "BROOK CROMTON","","B3","",""));
        drive.add(new Electric_motor("05m101","Конвейер №1 кромка гидроразбивателя",7.5,1470,380,15.6, "E-6.7.2", "МЭЗ","АИР132S4У3","B35","",""));
        drive.add(new Electric_motor("05m102","Конвейер №2 кромка гидроразбивателя",7.5,1450,380,15.6, "E-6.7.1", "ELDIN","A132S4","B3","",""));
        drive.add(new Electric_motor("05m1006","Насос гауч-мешалки №2",30,1470,415,55, "5С-8", "WEG","200L-04","B3","6312-C3","6312-Z-C3"));
        drive.add(new Electric_motor("05m103","Конвейер брака",5.5,960,415,11.3, "3D-6", "SEW EURODRIVE","KA127B DV132ML6/BM/HR","B5","",""));

        drive.add(new Electric_motor("06m2311","Экстракция конденсата",5.5,1450,400,11.3, "E-5.7.1", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2312","Экстракция конденсата",5.5,1450,400,11.3, "E-5.7.2", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2325","Экстракция конденсата",18.5,1450,400,35, "E-8.4.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2326","Экстракция конденсата",18.5,1450,400,35, "E-8.4.2", "WEG","160M-04","B3","NU311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2331","Экстракция конденсата",11,1465,400,22, "E-6.6.3", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2341","Экстракция конденсата",18.5,1450,400,35, "E-10.5.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2342","Экстракция конденсата",18.5,1450,400,35, "E-1.2.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2351","Экстракция конденсата",5.5,1450,400,11.3, "E-5.9.3", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2352","Экстракция конденсата",5.5,1450,400,11.3, "E-5.9.4", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2361","Экстракция конденсата",5.5,1450,400,11.3, "E-9.10.3", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2362","Экстракция конденсата",5.5,1450,400,11.3, "E-9.10.4", "WEG","132S-04","B3","6308-ZZ","6307-ZZ"));
        drive.add(new Electric_motor("06m2305","Линия возврата конденсата на ТЕЦ",45,2360,400,79, "E-7.2", "WEG","225S/M-02","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("06m2306","Линия возврата конденсата на ТЕЦ",45,2360,400,79, "E-2.3", "WEG","225S/M-02","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("06m2381","Экстракция конденсата",18.5,1450,400,36, "E-1.3.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("06m2313","Вакуумный деаэратор",18.5,1450,400,35, "E-1.3.2", "WEG","160M-04","B3","NU311-C3","6211Z-C3"));

        drive.add(new Electric_motor("07m2181","Вытяжной вентилятор гидроразбивателя пресса",18.5,1500,400,36, "G-3.6.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2191","Вытяжной вентилятор гидроразбивателя под накатом",22,1465,400,41, "G-3.5.1", "WEG","180L-04","B3","NU311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2001","Двигатель 1 подъема двери колпака",2.2,1465,400,5, "G-2.6.1", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2002","Двигатель 2 подъема двери колпака",2.2,1500,400,5, "G-2.7.1", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2003","Двигатель 3 подъема двери колпака",2.2,1500,400,5, "G-2.7.2", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2004","Двигатель 4 подъема двери колпака",2.2,1500,400,5, "G-2.7.3", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2005","Двигатель 5 подъема двери колпака",2.2,1500,400,5, "G-2.7.4", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2006","Двигатель 6 подъема двери колпака",2.2,1500,400,5, "G-3.7.1", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2007","Двигатель 7 подъема двери колпака",2.2,1500,400,5, "G-3.7.2", "SEW EURODRIVE","DRS90L4BE5HR/2W","B5","",""));
        drive.add(new Electric_motor("07m2011","Вентилятор дуоформера",110,1490,400,194, "G-9.1", "WEG","315S/M-04","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2034","Вытяжной ветилятор ПД 1 вентилятор",90,990,400,164, "G-8.2", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2044","Вытяжной ветилятор ПД 2 вентилятор",90,990,400,164, "G-7.2", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2054","Вытяжной ветилятор ПД 3 вентилятор",90,990,400,164, "G-6.2", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2064","Вытяжной ветилятор AД 1 вентилятор",90,990,400,164, "G-3.2", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2082","Приточный вентилятор ПД 1 вентилятор",160,1490,400,278, "G-7.1", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2114","Приточный вентилятор ПД 2 вентилятор",160,1490,400,278, "G-6.1", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2134","Приточный вентилятор ПД 3 вентилятор",160,1490,400,278, "G-3.1", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2154","Приточный вентилятор AД 1 вентилятор",160,1490,400,278, "G-2.1", "WEG","315S/M-06","B3","NU-319-C3","6316-C3"));
        drive.add(new Electric_motor("07m2239","Стенный вентилятор 10",18.5,1500,400,36, "G-3.6.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2072","Потолочный вентилятор",55,1475,400,97, "G-10.2", "WEG","250S/M-04","B3","NU-314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2201","Горизонтальный вентилятор 2 сторона привода",37,1485,400,68, "G-2.3", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2202","Горизонтальный вентилятор 2 сторона привода",37,1485,400,68, "G-3.3", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2252","Насос 1HS1 циркуляции гликоля",7.5,3000,400,15.2, "G-6.5.1", "KOLMEKS","KH-132E1F19","V1","6307-DDUC3E","6307-DDUC4E"));
        drive.add(new Electric_motor("07m2253","Насос 2HS1 циркуляции гликоля",5.5,3000,400,10.2, "G-6.5.3", "KOLMEKS","KH-132C1F19","V1","6307-DDUC3E","6307-DDUC4E"));
        drive.add(new Electric_motor("07m2254","Насос 3HS1 циркуляции гликоля",30,3000,400,55, "G-3.4", "KOLMEKS","KZ-205H1F31","V1","6312-DDUC3E","6312-DDUC3E"));
        drive.add(new Electric_motor("07m2255","Насос 4HS1 циркуляции гликоля",30,3000,400,55, "G-7.3", "KOLMEKS","KZ-205H1F31","V1","6312-DDUC3E","6312-DDUC3E"));
        drive.add(new Electric_motor("07m2452","Насос 1HS2 циркуляции гликоля",5.5,3000,400,10.2, "G-6.7.2", "KOLMEKS","KH-132C1F19","V1","6307-DDUC3E","6307-DDUC4E"));
        drive.add(new Electric_motor("07m2453","Насос 2HS2 циркуляции гликоля",30,3000,400,55, "G-7.4", "KOLMEKS","KZ-205H1F31","V1","6312-DDUC3E","6312-DDUC3E"));
        drive.add(new Electric_motor("07m2454","Насос 3HS2 циркуляции гликоля",30,3000,400,55, "G-6.4", "KOLMEKS","KZ-205H1F31","V1","6312-DDUC3E","6312-DDUC3E"));
        drive.add(new Electric_motor("07m2455","Насос 4HS2 циркуляции гликоля",30,3000,400,55, "G-8.3", "KOLMEKS","KZ-205H1F31","V1","6312-DDUC3E","6312-DDUC3E"));
        drive.add(new Electric_motor("07m2271","Горизантальный вентилятор 1 помещение вакуумных насосов",37,1485,400,68, "E-5.4", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2272","Горизантальный вентилятор 2 помещение вакуумных насосов",37,1485,400,68, "E-7.3", "WEG","225S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2273","Вытяжной вентилятор 1 с помещения вакуумных насосов",11,1465,400,22, "E-2.8.3", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2274","Вытяжной вентилятор 2 с помещения вакуумных насосов",11,1465,400,22, "E-2.8.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2275","Вытяжной вентилятор 3 с помещения вакуумных насосов",11,1465,400,22, "E-2.8.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2320","Основной насос №1 гликоля",90,1500,400,158, "E-5.1", "KOLMEKS","KZ-288K2F43","V1","6316-DDUC3ENS","6316-DDUC3ENS"));
        drive.add(new Electric_motor("07m2321","Насос 1 заполнения",4,1500,400,7.95, "E-8.6.3", "KOLMEKS","KH-112E1NE","B5","6205-VVC3E","6205-VVC4E"));
        drive.add(new Electric_motor("07m2420","Основной насос №2 гликоля",90,1500,400,158, "E-2.1", "KOLMEKS","KZ-288K2F43","V1","6316-DDUC3ENS","6316-DDUC3ENS"));
        drive.add(new Electric_motor("07m2421","Насос 2 заполнения",4,1500,400,7.95, "E-8.6.4", "KOLMEKS","KH-112E1NE","B5","6205-VVC3E","6205-VVC4E"));
        drive.add(new Electric_motor("07m2215","Вытяжной вентилятор с подвального и машинного этажа",37,985,415,65, "E-5.5", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2211","Вытяжной вентилятор 1 с машинного зала",37,985,415,65, "E-5.3", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2212","Вытяжной вентилятор 2 с машинного зала",37,985,415,65, "E-9.4", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2213","Вытяжной вентилятор 3 с машинного зала",37,985,415,65, "E-9.2", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2214","Вытяжной вентилятор 4 с машинного зала",37,985,415,65, "E-6.3", "WEG","250S/M6","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("07m2240","Стенный вентилятор 11",18.5,1500,400,36, "E-7.4.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2241","Стенный вентилятор 12",18.5,1500,400,36, "E-7.4.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2242","Стенный вентилятор 13",18.5,1500,400,36, "E-7.5.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2251","Стенный вентилятор 22",18.5,1500,400,36, "E-7.5.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2243","Стенный вентилятор 14",18.5,1500,400,36, "E-6.5.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2244","Стенный вентилятор 15",18.5,1500,400,36, "E-6.5.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2245","Стенный вентилятор 16",18.5,1500,400,36, "E-5.6.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2246","Стенный вентилятор 17",18.5,1500,400,36, "E-5.6.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2247","Стенный вентилятор 18",18.5,1500,400,36, "E-1.4.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2248","Стенный вентилятор 19",18.5,1500,400,36, "E-1.4.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2249","Стенный вентилятор 20",18.5,1500,400,36, "E-2.4.2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2250","Стенный вентилятор 21",18.5,1500,400,36, "E-2.4.1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2230","Стенный вентилятор 1",18.5,1500,400,36, "5A-7", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2231","Стенный вентилятор 2",18.5,1500,400,36, "6A-1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2232","Стенный вентилятор 3",18.5,1500,400,36, "6A-3", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2233","Стенный вентилятор 4",18.5,1500,400,36, "6A-5", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2234","Стенный вентилятор 5",18.5,1500,400,36, "10B-3", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2235","Стенный вентилятор 6",18.5,1500,400,36, "5C-1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2236","Стенный вентилятор 7",18.5,1500,400,36, "5C-2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2237","Стенный вентилятор 8",18.5,1500,400,36, "13C-1", "WEG","160M-04","B3","6311-C3","6211Z-C3"));
        drive.add(new Electric_motor("07m2238","Стенный вентилятор 9",18.5,1500,400,36, "4J-2", "WEG","160M-04","B3","6311-C3","6211Z-C3"));

        drive.add(new Electric_motor("08m503","Вакуум-насос VP3, зона гауч-вала 3",315,985,6000,39.9, "HV5-21", "WEG","HGF355C/D/E","B3","NU322-C3","6320-C3"));
        drive.add(new Electric_motor("08m505","Вакуум-насос VP5, зона гауч-вала 4",315,985,6000,39.9, "HV5-19", "WEG","HGF355C/D/E","B3","NU322-C3","6320-C3"));
        drive.add(new Electric_motor("08m506","Вакуум-насос VP6, BOX пресс",315,985,6000,39.9, "HV5-20", "WEG","HGF355C/D/E","B3","NU322-C3","6320-C3"));
        drive.add(new Electric_motor("08m507","Вакуум-насос VP7",450,980,6000,53.9, "HV5-17", "WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("08m510","Вакуум-насос VP10, вал пик-ап",450,985,6000,53.9, "HV5-18", "WEG","HGF400C/D/E","B3","NU224-C3","6320-C3"));
        drive.add(new Electric_motor("08m501","Вакуум-насос VP1, зона 1, зона 2",200,995,400,375, "K-1.1", "WEG","355M/L-06","B3","NU322-C3","6319-C3"));
        drive.add(new Electric_motor("08m502","Вакуум-насос VP2, зона гауч-вала 1 и 2",200,995,400,375, "K-2.1", "WEG","355M/L-06","B3","NU322-C3","6319-C3"));
        drive.add(new Electric_motor("08m504","Вакуум-насос VP4, нижнего сукна 1 го пресса",200,995,400,375, "K-8.1", "WEG","355M/L-06","B3","NU322-C3","6319-C3"));
        drive.add(new Electric_motor("08m512","Вакуум-насос VP12",75,1480,440,117, "K-6.2", "WEG","250S/M-04","B3","6318","6318"));
        drive.add(new Electric_motor("08m508","Вакуум-насос VP8, суконный ящик пик-ап",200,995,400,375, "K-7.1", "WEG","355M/L-06","B3","NU322-C3","6319-C3"));
        drive.add(new Electric_motor("08m509","Вакуум-насос VP9, верхнее сукно 3 го пресса",200,995,400,375, "K-9.1", "WEG","355M/L-06","B3","NU322-C3","6319-C3"));
        drive.add(new Electric_motor("08m2301","Вентилятор прессран",37,1481,415,68, "K-6.3", "ABB","M3BP225SMA4","B3","6313/C3","6212C3"));
        drive.add(new Electric_motor("08m2302","Вентилятор симран",37,1481,415,68, "K-7.4", "ABB","M3BP225SMA4","B3","6313/C3","6212/C3"));
        drive.add(new Electric_motor("08m2303","Вентилятор вакуумных валов-1 слалом",110,1500,415,189, "K-7.4", "ABB","M3BP315SMA4","B3","6319/C3","6216/C3"));
        drive.add(new Electric_motor("08m2304","Вентилятор вакуумных ящиков сетки",45,2965,400,79, "K-8.3", "LAMMERS","225M","B3","",""));
        drive.add(new Electric_motor("08m612","Вытяжной вентилятор скиммер",37,2960,415,63, "3B-4", "WEG","200L-2","B3","6312/C3","6212-2ZZ"));
        drive.add(new Electric_motor("08m095","Насос вакуум сепоратора нижнего сукона прессовой части",3,1430,440,5.9, "5B-2", "BROOK HANSEN","HAD100LB","B3","",""));
        drive.add(new Electric_motor("08m611","Вентилятор очистки сетки",75,2950,415,126, "12C-8", "TECO","250M","B3","6313","6213"));
        drive.add(new Electric_motor("08m534","Насос сборника после вакуум-насоса 2",22,1470,400,40, "6F-1", "WEG","180-L-04","V1","6311-C3","6211-C3"));
        drive.add(new Electric_motor("08m100","Насос сборника после вакуум-насоса 1",22,1470,400,40, "6F-2", "WEG","180-L-04","V1","6311-C3","6211-C3"));

        drive.add(new Electric_motor("09m528","Насос горячей воды для крахмала(резервный)",37,1480,440,62, "E-6.4", "BROOK CROMTON","7-AAD225S","B3","",""));
        drive.add(new Electric_motor("09m532","Сортировка храхмала №4",1.85,1410,415,3.86, "E-9.8.3", "","","B5","",""));
        drive.add(new Electric_motor("09m227","Насос подачи крахмала",55,1475,415,95, "E-5.2", "WEG","250S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("09m527","Насос горячей воды",45,1475,415,80, "E-8.3", "WEG","250S/M-04","B3","6314-C3","6314-C3"));
        drive.add(new Electric_motor("09m230","Сортировка крахмала №1",1.85,1410,415,3.86, "E-9.8.2", "","","B5","",""));
        drive.add(new Electric_motor("09m531","Сортировка крахмала №3",1.85,1410,415,3.86, "E-9.8.1", "","","B5","",""));
        drive.add(new Electric_motor("09m344","Мешалка бака крахмала",4,1425,440,8.4,"E-8.5.4", "BROOK CROMTON","UD112MD","V1","",""));
        drive.add(new Electric_motor("09m231","Сортировка крахмала №2",1.5,1420,415,3.9, "E-5.8.1", "BROOK CROMTON","AD90LN","V3","",""));
        drive.add(new Electric_motor("09m529","Сортировка крахмала №5",1.5,1420,415,3.9, "E-5.8.2", "BROOK CROMTON","AD90LN","V3","",""));
        drive.add(new Electric_motor("09m228","Насос подачи крахмала(резервный)",55,1475,415,95, "E-6.2", "WEG","250S/M-04","B5","6314-C3","6314-C3"));

        drive.add(new Electric_motor("11m1341","Бустерный насос",18.5,3000,400,36, "11A-2", "ABB","","B35","",""));
        drive.add(new Electric_motor("11m1562","Насос каустика",11,2920,415,19.5, "2C-1", "ABB","M2BA160MLA2","B3","6209-ZZ/C3","6209-ZZ/C3"));

        drive.add(new Electric_motor("18m351","Мешалка промежуточного бака мела РСС",15,1450,415,26.6, "3B-1", "BROOK CROMTON","HADF160LD","V1","",""));
        drive.add(new Electric_motor("18m1201","Насос дозировки РСС",30,2960,415,52, "9A-1", "WEG","200L-02","B3","6312-C3","6212-Z-C3"));
        drive.add(new Electric_motor("18m1202","Насос дозировки РСС(резерв)",30,2960,415,52, "6C-3", "WEG","200L-02","B3","6312-C3","6212-Z-C3"));

        drive.add(new Electric_motor("20m620","Горизонтальное регулирование щели",0.75,1435,400,1.9, "E-2.7.1", "SEW EURODRIVE","","B5","",""));
        drive.add(new Electric_motor("20m3001","Вертикальное регулирование щели",2.4,2630,400,5.5, "E-7.7.1", "SEW EURODRIVE","K47SDT100L6/2","B5","",""));
        drive.add(new Electric_motor("20m3002","Открывание коллектора напорного ящика",0.37,2655,400,1.1, "E-9.7.2", "SEW EURODRIVE","","B5","",""));

        drive.add(new Electric_motor("21m3005","Подъем грудного вала",2.2,1400,400,5, "E-9.9.3", "SEW EURODRIVE","","V1","",""));
        drive.add(new Electric_motor("21m680","Осцилятор шабера грудного вала",0.18,1340,415,0.6, "E-8.8.4", "","","B5","",""));
        drive.add(new Electric_motor("21m113","Сводна отсечка",0.56,2795,400,1.75, "5D-1", "","","B5","",""));
        drive.add(new Electric_motor("21m116","Подъем вала PICK-AP",3,1420,380,7.1, "5D-2", "","","B3","",""));
        drive.add(new Electric_motor("21m158","Насос гидравлики вала DUOFORMER",11,1460,380,22, "8D-1", "SIEMENS","1LA3163-4FF71-ZK48","B5","",""));

        drive.add(new Electric_motor("22m2008","Сукнонатяжка 1 пресса",3,1500,400,6.6, "E-2.7.3", "SEW EURODRIVE","RF47DR100LC4BE5","B5","",""));
        drive.add(new Electric_motor("22m2009","Сукнонатяжка 3 пресса",3,1500,400,6.6, "E-2.7.2", "SEW EURODRIVE","RF47DR100LC4BE5","B5","",""));
        drive.add(new Electric_motor("22m119","Насос гидравлики на прижим прессов(резервный)",15,1460,415,28, "3D-3", "ABB","","B5","",""));
        drive.add(new Electric_motor("22m159","Насос гидравлики на спрыски и осцилляцию сеточной части",7.5,1450,380,15.4, "6D-11", "BROOK CROMTON","W-DF132MR-H","B5","",""));
        drive.add(new Electric_motor("22m160","Насос гидравлики прессовой части(резервный)",15,1460,380,29, "8D-3", "SIEMENS","1LA-3166-4AA71-ZK48160L","B5","",""));
        drive.add(new Electric_motor("22m161","Насос гидравлики прессовой части",15,1460,380,29, "8D-4", "SIEMENS","1LA-3166-4AA71-ZK48160L","B5","",""));
        drive.add(new Electric_motor("22m117","Насос гидравлики на прижим прессов",15,1460,415,29, "9D-2", "WEG","160L-4","B5","6309-C3","6209-Z-C3"));
        drive.add(new Electric_motor("22m118","Насос гидравлики на прижим прессов",15,1460,415,28, "9D-3", "WEG","160L-4","B5","6309-C3","6209-Z-C3"));

        drive.add(new Electric_motor("23m643","Сукнонатяжка 2 группы сушки",4,1430,415,7.64, "E-8.5.3", "","","","",""));
        drive.add(new Electric_motor("23m140","Сукнонатяжка верхнего сукна 3 группы сушки",0.3,1400,380,0.95, "E-7.7.2", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("23m642","Осцилятор шабера-цилиндр №5",0,0,0,0, "", "","","B5","",""));
        drive.add(new Electric_motor("23m644","Осцилятор шабера-цилиндр №16",0.37,935,415,1.26, "E-8.7.2", "","","B5","",""));
        drive.add(new Electric_motor("23m645","Осцилятор шабера-цилиндр №20",0.37,935,415,1.26, "E-8.7.1", "","","B5","6303","6203"));
        drive.add(new Electric_motor("23m647","Осцилятор шабера-цилиндр №19",0,0,0,0, "", "","","B5","",""));
        drive.add(new Electric_motor("23m130","Осцилятор шабера-цилиндр №34",0.15,1400,440,0.56, "E-7.7.3", "","","B5","",""));
        drive.add(new Electric_motor("23m646","Осцилятор шабера-цилиндр №22",0.37,935,415,1.26, "E-5.7.4", "","","B5","6303","6203"));
        drive.add(new Electric_motor("23m131","Осцилятор шабера-цилиндр №35",0.18,1410,415,0.56, "E-8.8.3", "","","B5","",""));
        drive.add(new Electric_motor("23m125","Осцилятор шабера-цилиндр №14",0.37,1410,415,1.04, "E-5.7.3", "","","B5","6303","6203"));
        drive.add(new Electric_motor("23m124","Осцилятор шабера-цилиндр №13",0.15,1400,440,0.62, "E-6.7.3", "","","B5","",""));
        drive.add(new Electric_motor("23m120","Осцилятор шабера-цилиндр №3",0.18,1410,415,0.584, "3D-5", "","","B5","",""));
        drive.add(new Electric_motor("23m123","Осцилятор шабера-цилиндр №12",0.18,1410,400,0.584, "4D-1", "","","B5","",""));
        drive.add(new Electric_motor("23m126","Осцилятор шабера-цилиндр №17",0.18,1410,415,0.584, "4D-2", "","","B5","",""));
        drive.add(new Electric_motor("23m127","Осцилятор шабера-цилиндр №18",0.18,1410,415,0.584, "4D-3", "","","B5","",""));
        drive.add(new Electric_motor("23m128","Осцилятор шабера-цилиндр №23",0.15,1400,380,0.6, "4D-4", "","","B5","",""));
        drive.add(new Electric_motor("23m129","Осцилятор шабера-цилиндр №24",0.18,1380,380,0.58, "4D-6", "","","B5","",""));
        drive.add(new Electric_motor("23m138","Сукнонатяжка 1-ой сушильной группы",0.3,1400,380,0.95, "5D-3", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("23m139","Сукнонатяжка 2-ой сушильной группы",0.3,1400,380,0.95, "5D-4", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("23m141","Сукнонатяжка 3-ой сушильной группы(низ)",0.3,1400,380,0.95, "5D-5", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("23m142","Сукнонатяжка 2-ой группы сушки",0.3,1400,380,0.95, "5D-6", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("23m143","Сукнонатяжка 4-ой сушильной группы(низ)",0.3,1400,380,0.95, "5D-5", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));

        drive.add(new Electric_motor("24m164","Гидравлический насос клеильного пресса",11,1455,440,19.3, "E-7.9.3", "SIEMENS","1LA5163-4CA71 160M","B5","6209-ZZ/C3","6209-ZZ/C3"));
        drive.add(new Electric_motor("24m165","Гидравлический насос клеильного пресса(резервный)",11,1455,440,19.3, "E-7.9.4", "SIEMENS","1LA5163-4CA71 160M","B5","6209-ZZ/C3","6209-ZZ/C3"));
        drive.add(new Electric_motor("24m523","Насос нагрева трапика клеильного пресса",2.2,2900,415,4.6, "E-8.6.2", "WEG","90L-2","V1","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("24m522","Насос нагрева шабера клеильного пресса",1.5,1420,415,3.5, "E-9.9.2", "BROOK CROMTON","A-D90LK-D","V1","","6203ZZ"));
        drive.add(new Electric_motor("24m521","Насос нагрева аппликационных валиков клеильного пресса",7.5,2900,415,14, "E-9.10.1", "BROOK HANSEN","W-DA132SJ-D","V1","",""));
        drive.add(new Electric_motor("24m496","Вращение стержней клеильного пресса",1.5,1500,400,3.53, "ПНН-73", "FLENDER","CAZ48-M90L4","B5","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("24m497","Вращение стержней клеильного пресса",1.5,1500,400,3.53, "ПНН-73", "FLENDER","CAZ48-M90L4","B5","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("24m498","Вращение стержней клеильного пресса",1.5,1500,400,3.53, "ПНН-73", "FLENDER","CAZ48-M90L4","B5","6205ZZ","6204ZZ"));
        drive.add(new Electric_motor("24m499","Вращение стержней клеильного пресса",1.5,1500,400,3.53, "ПНН-73", "FLENDER","CAZ48-M90L4","B5","6205ZZ","6204ZZ"));

        drive.add(new Electric_motor("25m133","Осцилятор шабера -цилиндр 41(37)",0.15,1320,400,0.56, "E-6.7.4", "","","B5","",""));
        drive.add(new Electric_motor("25m135","Осцилятор шабера -цилиндр 39",0.18,1410,415,0.58, "E-8.8.2", "","","B5","",""));
        drive.add(new Electric_motor("25m134","Осцилятор шабера -цилиндр 38",0.18,1410,415,0.58, "E-8.8.1", "","","B5","",""));
        drive.add(new Electric_motor("25m3050","Осцилятор шабера -цилиндр 36",0.37,1380,400,1.24, "E-5.7.2", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m3051","Осцилятор шабера -цилиндр 37",0.37,1380,400,1.24, "E-5.7.1", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m3052","Осцилятор шабера -цилиндр 42",0.37,1380,400,1.24, "E-2.5.4", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m3053","Осцилятор шабера -цилиндр 43",0.37,1380,400,1.24, "E-2.5.3", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m3054","Осцилятор шабера -цилиндр 44",0.37,1380,400,1.24, "E-2.5.2", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m3055","Осцилятор шабера -цилиндр 45",0.37,1380,400,1.24, "E-2.5.1", "SEW EURODRIVE","R57DRS71S4/Al","B5","6303","6203"));
        drive.add(new Electric_motor("25m132","Осцилятор шабера -цилиндр 40",0.18,1320,400,0.56, "4D-5", "","","B5","",""));
        drive.add(new Electric_motor("25m136","Осцилятор шабера -цилиндр 46",0.15,1380,440,0.72, "4D-7", "","","B5","",""));
        drive.add(new Electric_motor("25m137","Осцилятор шабера -цилиндр 47",0.15,1380,380,0.72, "4D-8", "","","B5","",""));
        drive.add(new Electric_motor("25m144","Сукнонатяжка 6-ой сушильной группы(верх)",0.3,1400,380,0.95, "5D-8", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));
        drive.add(new Electric_motor("25m145","Сукнонатяжка 6-ой сушильной группы(низ)",0.3,1400,380,0.95, "5D-9", "SEW EURODRIVE","RF70DT71C-4B","B5","",""));

        drive.add(new Electric_motor("26m149","Насос горячей воды каландра",7.5,3000,415,15.6, "E-6.9.2", "","","B3","",""));
        drive.add(new Electric_motor("26m152","Двигатель фильтра бака гидравлики нижнего вала каландра",0.12,890,420,0.68, "6D-4", "WEM","","V1","",""));
        drive.add(new Electric_motor("26m150","Насос гидравлики нижнего вала каландра",4,1420,380,8.9, "6D-5", "DIETZ","FDR112M/4P","B5","",""));
        drive.add(new Electric_motor("26m151","Насос гидравлики нижнего вала каландра(резервный)",4,1420,380,8.9, "6D-6", "DIETZ","FDR112M/4P","B5","",""));
        drive.add(new Electric_motor("26m625","Осцилятор шабера каландра",0.55,1400,415,1.5, "6D-8", "","","B5","",""));
        drive.add(new Electric_motor("26m171","Насос гидравлики верхнего вала каландра(резервный)",17.25,1440,380,33.3, "8D-2", "SIEMENS","1LA3166-4AA71-Z","B5","",""));
        drive.add(new Electric_motor("26m162","Насос гидравлики верхнего вала каландра",17.25,1440,380,33.3, "8D-5", "SIEMENS","1LA3166-4AA71-Z","B5","",""));
        drive.add(new Electric_motor("26m430","Вентилятор CALCOIL",11,2935,400,19.9, "6F-3", "TECO","D160M","B35","",""));

        drive.add(new Electric_motor("27m615","Насос гидравлики наката №1",22,1460,400,40, "3D-1", "SIEMENS","1LA2186-4AA61","B5","",""));
        drive.add(new Electric_motor("27m616","Насос гидравлики наката №2",22,1460,400,40, "3D-2", "SIEMENS","1LA2186-4AA61","B5","",""));
        drive.add(new Electric_motor("27m617","Насос гидравлики наката(резервный)",22,1460,400,40, "3D-8", "SIEMENS","1LA2186-4AA61","B5","",""));
        drive.add(new Electric_motor("27m618","Осцилятор шабера наката",0.25,0,0,0, "6D-10", "","","B5","",""));

        drive.add(new Electric_motor("40m156","Насос смазки валиков сукна(резервный)",11,1450,440,18.9, "E-7.9.2","BROOK CROMTON","HAD160M","B3","",""));
        drive.add(new Electric_motor("40m155","Насос смазки валиков сукна",11,1450,440,18.9, "E-7.9.1","BROOK CROMTON","HAD160M","B3","",""));
        drive.add(new Electric_motor("40m671","2 станция сбора масла",1.1,1425,400,2.5, "E-5.8.3","SIEMENS","1LE10010EB002FA4 90S","B5","",""));
        drive.add(new Electric_motor("40m672","2 станция сбора масла(резервный)",1.1,1425,400,2.5, "E-5.8.4","SIEMENS","1LE10010EB002FA4 90S","B5","",""));

        drive.add(new Electric_motor("31m184","Двигатель 2-го несущего вала",245,1830,480,552, "ПНН-74","MAWDSLEYS LTD","225XL210","B3","DE6316","NDE6214RS"));
        drive.add(new Electric_motor("31m183","Двигатель 1-го несущего вала",245,1830,480,552, "ПНН-74","MAWDSLEYS LTD","225XL210","B3","DE6316","NDE6214RS"));
        drive.add(new Electric_motor("31m187","Двигатель разгонного вала",131,1670,450,321, "ПНН-74","MAWDSLEYS LTD","200XM328","B3","DE6315 ZZ","NDE6212"));
        drive.add(new Electric_motor("31m182","Двигатель расправляющего вала",18.5,2390,450,45, "ПНН-74","MAWDSLEYS LTD","180T762","B3","DE6310","NDE6207 2RS"));
        drive.add(new Electric_motor("31m181","Двигатель раската",400,1125,500,800, "ПНН-74","ENGLISH ELECTRIC","CS06/2038","B3","",""));

        drive.add(new Electric_motor("21m197","Формующий вал(низ)",480,1488,690,478, "ПНН-73","SIEMENS","1LA8357-4PM80","B3","6220-C3","6220-C3"));
        drive.add(new Electric_motor("21m198","Отсасывающий гауч-вал(низ)",480,1488,690,478, "ПНН-73","SIEMENS","1LA8357-4PM80","B3","6220-C3","6220-C3"));
        drive.add(new Electric_motor("21m204","3 вал DUOFORMER(верх)",480,1485,690,478, "ПНН-73","SIEMENS","1LA8357-4PM80","B3","6220-C3","6220-C3"));
        drive.add(new Electric_motor("21m199","Отсасывающий вал пикап",200,1490,690,198, "ПНН-73","SIEMENS","1LG6317-4PM80","B3","6219-C3","6219-C3"));

        drive.add(new Electric_motor("22m200","2-й отсасывающий пресс",480,1488,690,478, "ПНН-73","SIEMENS","1LA8357-4PM80","B3","6220-C3","6220-C3"));
        drive.add(new Electric_motor("22m201","1-й желобчатый пресс",385,1488,690,385, "ПНН-73","SIEMENS","1LA8355-4PM80","B3","",""));
        drive.add(new Electric_motor("22m203","3-й верхний пресс",615,1491,690,604, "ПНН-73","SIEMENS","1LA8405-4PM80","B3","6224-C3","6224-C3"));

        drive.add(new Electric_motor("23m205A","1-я сушильная секция",160,1490,690,158, "ПНН-73","SIEMENS","1LG6316-4PM80","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("23m205B","2-я сушильная секция",110,1488,690,111, "ПНН-73","SIEMENS","1LG6310-4PM80","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("23m205C","2-я сушильная секция",90,1488,690,0, "ПНН-73","SIEMENS","1LG6310-4PM80","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("23m206","2-я сушильная группа",290,1485,690,287, "ПНН-73","SIEMENS","1LA8317-4PM80","B3","6218-C3","6218-C3"));
        drive.add(new Electric_motor("23m207","3-я сушильная секция",290,1485,690,287, "ПНН-73","SIEMENS","1LA8317-4PM80","B3","6218-C3","6218-C3"));
        drive.add(new Electric_motor("23m208","4-я сушильная секция",290,1485,690,287, "ПНН-73","SIEMENS","1LA8317-4PM80","B3","6218-C3","6218-C3"));

        drive.add(new Electric_motor("24m209","Бумаговедущий валик 13",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("24m210","Бумаговедущий валик 14",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("24m211","Бумаговедущий валик 15",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("24m212","Поворотный вал",160,1490,690,158, "ПНН-73","SIEMENS","1LG6316-4PM80","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("24m213","Неподвижный вал",160,1490,690,158, "ПНН-73","SIEMENS","1LG6316-4PM80","B3","6319-C3","6319-C3"));
        drive.add(new Electric_motor("24m214","Бумаговедущий валик 18",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));

        drive.add(new Electric_motor("25m215","Бумаговедущий валик 19",22,1470,400,41, "ПНН-73","SIEMENS","1LG6186-4AA60","B3","6210-C3","6210-C3"));
        drive.add(new Electric_motor("25m216","5-я сушильная секция",45,1480,400,81, "ПНН-73","SIEMENS","1LG6223-4AA60","B3","6212-C3","6212-C3"));
        drive.add(new Electric_motor("25m217","6-я сушильная секция",290,1480,690,287, "ПНН-73","SIEMENS","1LA8317-4PM80","B3","6218-C3/6218-C3","6218-C3"));

        drive.add(new Electric_motor("26m218","Бумаговедущий валик 22",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("26m219","Бумаговедущий валик 23",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("26m220A","Каландр вал",110,1488,690,111, "ПНН-73","SIEMENS","1LG6310-4PM80","B3","6319-C3/6319-C3","6319-C3"));
        drive.add(new Electric_motor("26m220B","Каландр вал верхний ",200,1490,690,198, "ПНН-73","SIEMENS","1LG6317-4ЗЬ80","B3","6319-C3","6319-C3"));

        drive.add(new Electric_motor("27m221","Бумаговедущий валик 25",18.5,730,400,36, "ПНН-73","SIEMENS","1LG6220-8AB60","B3","6213-C3","6213-C3"));
        drive.add(new Electric_motor("27m222","Бумаговедущий валик 26",22,1470,400,41, "ПНН-73","SIEMENS","1LG6186-4AA60","B3","6210-C3","6210-C3"));

        ch=false;
        descript=findViewById(R.id.descript);
        posit=findViewById(R.id.posit);
        pow=findViewById(R.id.pow);
        row=findViewById(R.id.row);
        volt=findViewById(R.id.volt);
        amper=findViewById(R.id.amper);
        loc=findViewById(R.id.loc);
        mark=findViewById(R.id.mark);
        type=findViewById(R.id.type);
        mMethod=findViewById(R.id.mMethod);
        fBearing=findViewById(R.id.fBearing);
        sBearing=findViewById(R.id.sBearing);

        Intent intent = getIntent();
        String name = intent.getStringExtra("");

        for(Electric_motor e : drive){
            if(e.getPosit().equals(name)){

              descript.setText(e.getDescript());
              posit.setText(e.getPosit());

             if(e.getPow()!=0){                                   //если мощность не равна нулю
                 if(e.getPow()% 1 == 0){                          // если мощность поделить на 1 и остаток равен нулю
                     int p = (int) e.getPow();
                     String aPow=("Мощность: "+p+" кВт");
                     pow.setText(aPow);
                 }else{
                 String aPow=("Мощность: "+e.getPow()+" кВт");
                 pow.setText(aPow);
                 }
             }else pow.setText("Мощность:");


             if(e.getRow()!=0){String aRow=("Обороты: "+e.getRow()+" об/мин");
             row.setText(aRow);}else row.setText("Обороты:");

             if(e.getVolt()!=0){ String aVolt=("Напряжение: "+e.getVolt()+" B");
              volt.setText(aVolt);}else volt.setText("Напряжение:");


             if(e.getAmper()!=0){                                          //если ток не равен  нулю
                 if(e.getAmper() % 1 == 0){                                // если ток поделить на 1 и остаток равен нулю
                     int a = (int)e.getAmper();
                     String aAmper = ("Ток: "+a+" A");
                     amper.setText(aAmper);
                 }else {
                     String aAmper = ("Ток: " + e.getAmper() + " A");
                     amper.setText(aAmper);
                 }
             }else amper.setText("Ток: ");


              loc.setText(e.getLoc());

              String Mark=("Марка: "+e.getMark());
              mark.setText(Mark);

              String Type=("Тип: "+e.getType());
              type.setText(Type);

              String Method=("Способ монтажа: "+e.getMethod());
              mMethod.setText(Method);

              String FB=("ПП: "+e.getfBearing());
              fBearing.setText(FB);

              String SB=("ЗП: "+e.getsBearing());
              sBearing.setText(SB);
              ch=true;
            }
        }
        if(!ch) {
            Toast toast = Toast.makeText(ViewActivity.this, "Двигатель не найден", Toast.LENGTH_LONG);toast.show();
        }
    }

}
